{"podcast_details": {"podcast_title": "The New Way We Work", "episode_title": "How to know when it’s time to quit your job", "episode_image": "https://megaphone.imgix.net/podcasts/27cdc588-bab2-11e9-aaab-2ff071190a07/image/uploads_2F1610854581076-9imp7soazp-b2f46d8dcde15bddf4cc8524e6b2192f_2FNewWay_cover.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " This is The New Way We Work from Fast Company Magazine where we take listeners on a journey through the changing landscape of our work lives and explain what we need to build the future we want. I'm Fast Company Deputy Editor Kathleen Davis. Whether you're miserable and dream of quitting your job in a dramatic, TikTok-worthy fashion or you're just feeling stagnant and uninspired, leaving your job is a huge decision. Today's episode is an edited version of a recent LinkedIn audio conversation I had with my colleagues Senior Editor Julia Hurst and Staff Editor AJ Hess. We covered red flags that it's time to quit your job, steps to take once you've made the decision, how quitting can be a good career move, and a lot more. Take a listen. So regardless of if the great resignation is over or not, people are always going to be quitting their jobs. But knowing when it's time to quit, how to do it, and what to do after you quit can be fraught. AJ, Julia, and I are all here at Fast Company because we've quit a job at some previous point in our careers. Most people will likely quit a job at some point. Without naming the company, obviously, let's say why we left our past jobs. I will start. Some of my earliest jobs I left because I was moving. I moved to London after college, so I left my post-college jobs. More recently, I left jobs previous to Fast Company because, and I think this is really common, there was no room for advancement. I knew I wasn't getting paid what I was worth and I wasn't going to get it there and I wasn't going to get promoted. It was going nowhere. Julia, AJ, how about you? Why have you left previous jobs? No room for advancement definitely resonates with me. I would say needing a new challenge and feeling like I had to find a different place in order to take that next step in my career. I've also, because I work in media, been at a place where widespread layoffs have happened. They didn't actually affect me directly, but they affected a lot of my mentors and more senior editors. I just felt like maybe this isn't the right place for me anymore. Working in media for any amount of time, layoffs is something that you experience to totally change the landscape of work and a job that you used to like can totally change. Yeah, I can definitely relate to both of those, unfortunately. The only other experience I would add there is I've had an existential crisis driven quitting before where I looked around at the time I was working in a finance role and I was like, what the hell am I doing here? I'm okay at this job, but it's not really what I want to do. That's what I did before I got into journalism. I think that happens a lot and I feel like that happened for a lot of people after the start of the pandemic when there was more time to reflect and be like, is this something that I can see myself doing long term that brings me some degree of joy as well as just being a paycheck? I feel like a lot of people had that realization. Yeah, that's what was driving the great resignation. It was like, if our time on this earth is limited, if the people are taking stock, I think that we didn't put this in our poll, existential crisis is a reason to quit. But yeah, I think that was a huge driver, especially recently. You did a poll, should you quit without having another job lined up? And I put this question partly because, and in my notes for this, I put fashion bug story. When I was in high school, I worked at a clothing store. I'm going to actually name the company. I have no idea if it still exists, but I worked at a clothing store and I got paid minimum wage and then I found out that they had cheated me. I was not getting paid what I was supposed to on my paycheck and I was so mad and I was 17. I was like, I'm going to quit. You cannot ever quit a job unless you have another one lined up. And I was like, I'm 17 years old. But that's really stuck with me that you never leave a job until you have another one lined up. So we asked our LinkedIn audience, and should you ever quit a job without having one lined up? 50% said depends on your finances, which I think is the bottom line for a lot of people. And then the 30% was only in extreme circumstances. I think if you have a cushion of savings, if you have a two income household where you have another income to fall back on, it makes it a softer landing. I was almost a little surprised that only 9% of people said, yes, fortune favors the bold. You should just jump and build the parachute as you're flying down. And only 10% said, no, you should never quit a job without having one lined up. I think it really depends on so many factors, but obviously finances being first and foremost for most folks, I would say. But also I think your industry rate and how hard it might be to find another job, that could be a factor. And then I think we got this good comment under this first poll, which I think is a really good point. It says, if the role is putting you at unreasonable risk for harm to your physical, mental, financial, or legal well-being, quit. Obviously there are extreme situations where your mental and or physical health and safety could be at risk. And so that's obviously an extreme circumstance that should be considered. Yeah, totally. That was what I was thinking of under that extreme circumstance. And I think we'll get a little bit more to that in like red flags that you should quit your job. Speaking of AJ, you're going to start us off by talking about some signs that you should quit. Yeah. Whenever I think about the signs that you should quit, I think of this great article that Christina Nozzo wrote for us about the three red flags that mean it's time to quit. In her eyes, she suggests that you should quit one, if you don't feel valued, two, if you're tired all the time, and three, if you're not learning anything new. And I think all of those are really good reasons I would add physical, mental, safety issues. But I think all those red flags are important. But personally, the number three is really valuable in my mind, because it's pretty quantifiable. I think we all sometimes feel not 100% fulfilled by work. It's easy to get disgruntled feelings, which can come and go. But sitting back and thinking, have I actually learned anything new? Have I actually grown in the past year or so? Is a pretty objective question you can ask yourself to help make your decision. Yeah, I think that's a great point. And I think also the idea that we all have bad days or weeks, right? Work is not always going to be endlessly fulfilling. But if it's a theme, right, if you're feeling like this in a longer term setting. And I think also if the answer to three is like, no, I'm not learning anything new, and I can't figure out a way to learn something new, that is also a key part of it. Because it's possible sometimes to pivot at your place of work or take on new responsibilities. Or maybe you could be taking some classes or other. There are other ways that don't require totally quitting that might bring that feeling that you are learning something. But there are also times when that's just not possible in a role. That's true. Number three does feel like the most solvable to me. If you want to learn something new, there's ways to figure out how to do it as you outline. I would also say some people, there's always seasons of ambition too. And maybe you're okay not learning something new for a while. Those are red flags if you're feeling unhappy in your job, I think. But obviously, they're not feeling valued and the feeling tired are signs of burnout and dissatisfaction. But maybe you're okay just like being in your job for a little bit. Yeah, 100%. We did a poll on this too, AJ. What did people say? Yeah, the poll on this one, we said, what is the biggest red flag that you should quit a job? The biggest, most common response was because your boss or coworkers are toxic. 61% of respondents said that was the main red flag for why you should quit a job. And then it was kind of split down the others of you don't feel valued, you feel tired and burnt down and you stopped learning. My favorite comment for the biggest red flag for why you should quit a job was ethics and legal violations. I think that's a pretty clear one. Clear cut example. Owners are going to jail, maybe you shouldn't jump ship. I think that's really fair. And then yeah, no, it seems like there's a consensus that if you have a toxic boss or coworker, they might be time to go. We've talked about how you can address if you stopped learning. If you don't feel valued and if you feel burned out, those are a little bit trickier to solve, but you can work on them. But yeah, you can't change a toxic boss or coworker other than to not work with them anymore. Julia, you were going to talk about finding the courage to quit. So basically it's like you got the red flags, you decide that it's time to quit, then you have to like actually do it. Actually do it. Yeah. And that's easier said than done in a lot of situations. So yes, talking about getting up the courage to quit, it can be stressful depending obviously on your work environment and the relationship you've had with your boss and your coworkers. Stephanie Vozo, who is a great writer who writes for us all the time, wrote a piece for us earlier this year and she interviewed Julia Keller, who is the author of Quitting a Life Strategy, the Myth of Perseverance and How the New Science of Giving Up Can Set You Free. And so Julia actually interviewed more than 150 people who would quit some things. And that could have been quitting a job or their belief system, but you can quit a lot of different types of things. And so I think that might be a good article for people to check out if you are considering quitting. You can also check the book out. It gives you some kind of tips about coming to terms with the idea of quitting and shifting your perspective, thinking of it less of like giving up a thing and more of what you might be gaining. Obviously there's a cost to staying in a situation that isn't a good fit for you, right? So before you actually make the move, just recalibrating how you're thinking about it in your head and thinking of it as an opportunity. I think sometimes if you're in that place of like, should I do this? Should I not do this? It can be really helpful to sort of pretend you've made the decision already and live with that choice for a little bit and see how you feel about it. Sometimes I'll do that with a big decision, like pretend I've already made it one way or the other and then just see how I feel about that. I think those sorts of thought experiments can be really helpful. And then I think the other thing is just going into the actual quitting, like how you're going to give your two weeks with a plan. Take out what you want to say, how you want to say it, how you want to take your boss aside or whatever you're going to do so that you can feel fully prepared and not have any regrets about that process. That's a great idea. I had never thought of pretending that you've made the decision. And I'm certainly a person that can be indecisive sometimes and have buyer's remorse about decisions, but it's like you pretend that you have actually quit and do you instantly start to regret it? That kind of tells you what your true feelings are. Yeah, for sure. I've done that with a lot of big decisions in my life. And even like, how would you feel about telling a person in your life that you've made this decision? I think that can signal if it's going to be a good fit for you. Has it ever revealed a way that you didn't think you thought? You know, I don't think I've ever pretended I've made a decision that been like, okay, absolutely not. But I think it has given me more confidence that I made the choice the right way before actually making the choice. That's good. Yeah. Well, speaking of once you decide that you want to quit, think like everyone's like, oh, I know how to quit a job. Like I quit. And there's certainly like all of the viral videos of the dramatic way to quit your job, which can be really fun to watch and fantasize about. But I think we hopefully all know that it's not a great idea to dramatically quit your job ever. Even if you have a really toxic environment that you can't wait to leave, the world is small and you will encounter people again and there's never any like the momentary benefit of like how good that feels to the long term potential career hurting to burn bridges and leave a bad impression. So once you decide to quit, here's the basics of how to go about it. So first, you should prepare what you want to say and keep it short. I think like you might be saying like, well, I know what I want to say, I want to quit, but it's good to kind of even maybe script it out, just plan it a little bit, keep it short. You don't need to like go into super big details. I do think and a lot of advice that we, professional advice does say that you should actually write a resignation letter. I think a lot of people might feel that it's not necessary, like you're verbally quitting, but it's always good to put it in writing, especially then you can put your notice and your plan in writing too. Make it official. A lot of employers require it too, like it was an HR requirement. And then you should set up a meeting with your direct manager. Then you should go to your coworkers, HR, upper management, depending on your company's protocol or your relationship with people. Two weeks notice is obviously the industry standard, I think for a lot of upper management positions or for if you've been with the company for a long time, sometimes it's nice if possible, if you're leaving on good terms to give a longer lead notice. And then there's a part of that too that, I mean, you know your position and your company, if this is something that might come up, but to prep for the possibility of a counter offer. You know, if they say, is there a way that we can convince you to stay? Is there something, prep for that possibility. Like, is there a circumstances under which you would stay at your job or are there absolutely not? And are those circumstances, plan what those are? Are they monetary? Are they a position change? Are they responsibility change? This is a big one that I've heard people talk about for years is getting your bluff called basically, like I want a promotion, I want a raise, I'm going to fake that I'm going to leave, I'm going to say that I have another offer so that you counter offer me to get me to stay, you better be willing to actually quit because who knows if that'll actually happen, that's a really risky thing to do. And then I think the last and most important step when you're quitting is to continue to do good work and to set up a transition plan. I think there's a big tendency or a feeling to just say like, I'm done, I'm going to sit back for two weeks and just like let the clock tick and like, I'm not working here anymore. But you can ruin years at a job by leaving a bad impression in those last two weeks. And the people that you work with, you could work with again, you don't want to set them up for failure, you want to be able to transfer all of your contacts, all of your systems, all of your everything to somebody so that they have a smooth transition after you leave and you've left a good impression after you've left. What do you all think about that? I think that all makes sense. I do feel like two weeks notice is usually good except in kind of extenuating circumstances. I think there's a danger sometimes to giving a lot more notice than that. It can just extend the sort of weird intermediate period, like unless there are actively projects you really want to finish up but that are important to you. I think in general, it's better to keep it to the two weeks notice. Yeah, I completely agree. I had a friend who out of the best intentions was like, I'm going to tell them that my last month will be September or whatever. I'll give them two months and I was like, that is a horrible idea. That's a long time, two months. It was like an extra week maybe. Exactly. And I was like, that's just going to build resentment. People are going to know you're leaving for so long. People might try and pile up for work on your plate before you leave. You should just keep it professional and short and I think that's what ended up happening. We asked our LinkedIn audience, what's the most important way to leave a good impression when you're quitting? And overwhelmingly people said training and handing over work, two weeks notice was at 24% and honest exit interview, which is something we're going to get to is 15%. But 60% of people said training or handing over work. And I think that's really true because think about when somebody leaves and a month later it was like, oh, where's that Google doc? I think Kate had it. I have no idea where it is. You know, and then like worst case scenario, people are like tracking you down with your personal email at your new job trying to find things out, but whenever you quit, your name is going to come up after you're not there anymore and you want your name to come up in a good context, you know? Totally. Yeah. I think one of the common questions we get is basically like, is there ever a time when you don't need to give two weeks notice? Kate, I'd be interested in your take on that. I think it falls again on that super extenuating toxic circumstances, right? When it's like you have to get out of there for your own mental health, there's something really bad that being there is going to hurt you in some way. Otherwise, hopefully you do like some of the people that you work with and you can leave a good impression with those folks. Yeah, I totally agree. And prioritizing in those two weeks, really focusing on handing things off and making sure that things are left in a place that's reasonable for your coworkers and those people you do care about. AJ, let's talk about exit interviews. Yeah, one of the most awkward parts of quitting can be the exit interview. You have to navigate if you're going to ask for one, if someone else is going to set it up, figuring out who should be in your exit interview, what you should say, what you shouldn't say. I think the central tension comes down to if you should be fully honest in your exit interview. While I might personally believe that honesty is typically the best policy, there are perfectly legitimate reasons why many workers would feel that they shouldn't overshare and risk hurting the relationships they've had. You're already out the door, why leave a sour note in people's mouths? Which I'm very empathetic to that, but Amita Malik recently wrote an article for us that argues that the stigma of burning bridges often stops people from speaking out about unhealthy work environments. And she really makes a great case for being honest and clear why you're leaving a job, especially if it's something like a toxic coworker or a toxic boss or a toxic environment. Fortunately, I think there are ways to be honest and polite when you're sharing feedback during an exit interview. Sarah Sutton, for instance, wrote an article for us about how to politely share the real reason why you're leaving a job. And there are some tricks. Among them is a compliment sandwich, right? Being like, well, I really loved working here. One thing I would say is that I often got emails after 8 p.m., but ultimately I had a really wonderful experience and I learned a lot, right? You can couple it in there or you can hedge and you can say, while I completely understand why we always had really busy periods of the year, it really felt like my schedule was hectic and I didn't get a great work-life balance. So those are my thoughts. We asked you all about what you should share in an exit interview and 51% of respondents said that you should share things the company can't change. The other things, 42% said you should share the real reason you're leaving and only 1% of people said you should share complaints from coworkers. What do you guys think? I was surprised that the complaints from coworkers was 1%. I guess people are like, not my problem. But I feel like that kind of folds into the things that the company can change. If it's like everybody here is feeling really burned out and overworked and they hate this one aspect of it, I think that definitely falls into the things that the company can change. It's like, look, I really believed in the mission of this company, but I feel like this and this have changed since my time here and it's not sustainable anymore. I want this company to be successful and I think other people are feeling that as well. It can definitely be an opportunity to help those you care about on your way out. I think there are lots of problems with exit interviews, including sometimes who conducts them. It's possible if it's someone who's out of the department or HR, they might not always get back to the right people in the right way. There's the danger of that. Or if it's somebody you were directly involved with you didn't have a good relationship with, that can also be very challenging, I think. But in general, I think there are ways to convey honesty and truth to whatever degree is possible and hopefully help make things better for the people who are still there on your way out without ruining relationships as you head out the door. That's true. And I think exit interviews are traditionally conducted by HR and that's a good point that you make that it's like, is this feedback going to make it back to my team, to my direct manager? Or if you are quitting because of your direct manager and your direct manager is doing the exit interview, that obviously can be super awkward. But I think 42% said the real reason why you're leaving. And if the real reason why you're leaving is something like what we had talked about at the top of the real reasons why we left, I'm not getting paid enough and there's no room for advancement. So I have to go elsewhere. I think that's a really honest and useful thing for them to know. It's like there's no room for advancement here and you're going to lose other people if you don't address that. Yeah. On that note, I'll say that honesty was very helpful when I quit that job for existential crisis reasons. Did you tell them you were having an existential crisis? Yeah. There was no harsh feelings. They were like, listen, we completely get it. It was ultimately a great easy way to have that conversation. Yeah. I do think if it's something bigger or I'm reevaluating what I want to prioritize on, I'm doing some sort of career pivot in some ways, that's almost easier because it's about your personal situation and less about this specific company or their workplace. It's not you, it's me. Exactly. But it's so often is, most of the times it is them though. I mean, in the existential crisis, it's not, but in all of the other ones, it's like, it's you. Yeah. I mean, often the truth is it's you and it's me, right? Well, we had a comment in the poll and this is getting at what you were saying, Julia. They said, it's very difficult to leave a truly honest exit interview. No employer I've ever worked for would be able to take the truth without their own ego getting in the way. What's more, many times they're holding the final paychecks and the ability to give you an honest referral if you ever need one. Hopefully it wouldn't be a situation where somebody is not going to give you your final paycheck. It's certainly a way to give them honest feedback, hopefully. I mean, I think that's so true without their own ego getting in the way if it's like, especially if it's a management issue or something like that, that is difficult. And we've written several articles about this, like an exit interview and honest information and exit interview is like such a gift to an employer in the same way that feedback for managers is such a gift because it's so rare that employees feel safe enough to give that honest feedback and you'll never know what you're lacking unless somebody gives that to you. Hopefully in an exit interview, because you feel like you have a little less to lose, you can be a little more honest. Totally agree. Yeah. And I think it's also, we received some comments about other things you can do on the way out, right? So you have the exit interview, but then there are also these opportunities to say goodbye to other people you work with. And sometimes that can be more important and good for networking, but also just good for you and for closing out that moment in time and making sure you prioritize having that final conversation with other people that you work with and that you care about is also something that should be prioritized. I think too, like people are focusing a lot on the references maybe from your direct boss, those sorts of things, but there's a lot of people that can give you references. There's a lot of people, as you say, to say goodbye to, to have an ending kind of note with and maybe you can give some of that feedback to other people as well. Julia, you were going to talk about alternatives to quitting, we kind of alluded to this a little bit before. Yeah, we talked a little bit about this, so I won't dwell on it for too long, but I do think that it is important as you were deciding if you're going to actually take that step and give your two weeks, if that's the right path to go down, right? And there are certainly plenty of reasons why making such a radical change can not be a good choice, including financial security. And also sometimes it's just not necessary, right? So I was talking about Julia Keller, the author and journalist earlier, she was the author of that book, Quitting a Life Strategy. And she, in that book, she talks about the idea of quasi quitting, which is not, that's not like quiet quitting. It's the idea that like quitting doesn't have to be a binary on off switch, right? It could be a more gradual process, it could be a redirection or reprioritization. So maybe it's you've realized that your passion for X topic is no longer and you are going to enter into a period of prioritizing other mindsets or priorities or areas of interest. But I think it's just important to remember that quitting can be kind of a more strategic decision and it can happen over a period of time as opposed to just walking into your manager's office and saying, I'm out of here. Yeah. And my two cents in defense of quasi quitting is that often it comes from a well intentioned person who thinks that they have to give 100% all the time. And I think it is in both workers and organizations best interest for people to sometimes take slower breaks and recharge. And if the answer is for a month or two, you do your basic job and you don't go above and beyond, but that means next month you can come back fully recharged and actually refine inspiration in your job. That's ultimately the best outcome for everyone. So I think often we shouldn't have so much stigma around quasi quitting. It's perfectly natural to take a little bit of a step back. Well that kind of goes hand in hand with like the backlash to last summer's quiet quitting trend is like so many people were saying, well, quiet quitting is just doing your job. Like quasi quitting is just doing your job. It's like the pushback against this hustle culture of productivity of like, you always have to go above and beyond. Like doing well at your job means doing extra. A lot of people, millions of people just do their job when that's fine. And maybe that's fine for a short time, as you said, maybe that's fine for a longer time. Maybe it is a sign depending on your personality that you do need a different job. But yes, in defense of quasi and quiet quitting slash just doing your work sometimes. Yeah. And I think with quasi quitting, just to explain the differences, like sometimes it's actually not that you're putting any less percent of effort in, it's just that it's different effort too. Right. So it's like, instead of having the priority that this needs to be the thing you're putting 110% into, it's just shifting that too. So it can just be more of a more like a pivot, I think we could describe it as versus like stepping back. Yeah, I like that. All right. Well, so now I'm going to talk about what comes next after quitting. We've alluded to this a couple of times on like leaving a good impression and leaving a good impression is so important because what comes next after quitting is maybe it's finding a new job, but maybe you already have a new job. But certainly the people that you worked with for however long you worked with them, I certainly say this is true of media, it's a small world. You will meet those people again, they will come up again, they will come up on LinkedIn especially. One thing that former coworkers have done with me and I have tried to reciprocate after leaving jobs is putting recommendations on your like LinkedIn profile, endorsing their skills, putting a little thing of like, this is how it was to work with them, keeping that like networking part going. This is a little bit old school, but it makes a great impression. Getting thank you notes and then the notes can be emails obviously or a text message, but just like following up with the people that you spent so much of your life with, right? Depending on how long you work there, you spend a lot of your life with these people. So thanking them, following up with them, checking in with former coworkers. I always love the ketchup drinks with a former coworker a couple months after the fact. And yeah, like giving recommendations, asking for recommendations. All of those things are also building goodwill for when you will inevitably need help from somebody else that you used to work with. Do either one of you have any like experience with the following up what comes next after quitting? No, I mean, I think that's all great advice. And I also love catching up with former coworkers and hearing what they're up to. Even if you're happy at the place that you're at, it's still very cool to just hear what other folks are doing, especially I think in an industry that is as small and ever changing as media is, it's just it's cool to see what's out there. And I think prioritizing doing that with people you enjoyed working with is a really good idea, both in the kind of short term and then longer term too. Yeah. And in my experience, the goodbye drinks are some of the best networking and bonding afterwork happy hours you can go to. It'll be good for your soul. It's good to have closure. I think those are always worth it. Now I can tell you what I've always thought of you. I will even say like former Fast Company colleagues that stayed in touch with each other, that then got jobs at different places, that then ended up hiring or having a freelancer or something with another former colleague, like keeping those connections up are, as we all know and as we've written about a lot, most people get a job through recommendations, not usually through a posted job. So keeping those good relationships is what's going to get you maybe not your next job, but your next next job or who knows. And the last thing that I wanted to talk about is what to do when you can't quit. So we've talked about this a little bit. Again, there's like the extreme circumstances where you just have to quit for your mental health or situations like that. But when you're in a situation where you want to quit, but you can't, and we've talked about this a little bit, you can really double down on the things that you like to do in your job. You can double down on the people that you like to work with, kind of scheduling more time either to work with them or just even connect with them. I say it all the time of like, you quit a manager, not a job, who you work with really makes your job. And so if you're unhappy in your job and there are people that you like, if you can steer or schedule your time towards those people and those strengths and those things that you like, it can make a bad job more, more bearable in that time that you can't quit. And that's all that I had to say on this topic. I don't know, Julia, AJ, is there anything more that you wanted to add? I feel like we've covered so much in this. Thank you, AJ and Julia. It's a pleasure to chat. Thanks Kate. Thank you. Bye. Take care, everyone. And that's all for this episode. If you're a new listener, be sure to subscribe to The New Way We Work wherever you listen. And if you like this episode, leave us a rating and review on Apple Podcasts. And we want to hear from you. Work is changing every day. What's the most pressing issue on your mind? Tell us at podcast at fastcompany.com or tweet us with the hashtag the new way we work. The New Way We Work is produced by Joshua Christensen and Julia Hsu with editing by Nicholas Torres."}, "podcast_summary": "In this episode of \"The New Way We Work\" podcast, the hosts discuss the decision to quit a job and the steps to take when resigning. They share their own experiences and reasons for leaving previous jobs, such as lack of advancement opportunities, the need for new challenges, and experiencing widespread layoffs. They explore red flags that indicate it's time to quit, including feeling undervalued, constant fatigue, and lack of learning opportunities. The hosts also highlight the importance of leaving a good impression when quitting, from preparing what to say in a resignation letter to setting up a meeting with your direct manager and informing your co-workers and HR about your decision. They emphasize the importance of giving notice and ensuring a smooth transition for those who will continue working at the company. The podcast also addresses the topic of exit interviews and the value of honest feedback in identifying and addressing issues within an organization. Finally, the hosts discuss alternatives to quitting, such as \"quasi-quitting,\" which involves redirecting or reprioritizing efforts rather than making a sudden and complete departure from a job. They also emphasize the importance of staying connected with former colleagues and maintaining relationships for networking purposes. The hosts conclude by offering advice for those who find themselves in situations where they want to quit but can't, encouraging them to focus on the aspects of their job they enjoy and on nurturing relationships with supportive colleagues.", "podcast_guest": {"guest_name": "Julia Keller", "guest_organization": null, "guest_title": null}, "podcast_highlights": "In this episode, the hosts discuss the topic of quitting jobs and provide insights on when it's time to quit, how to quit effectively, and what comes next after quitting. They emphasize the importance of recognizing red flags that indicate it's time to leave a job, such as feeling undervalued, constantly exhausted, or lacking opportunities for growth. They also discuss the concept of quasi-quitting, which involves gradually redirecting or reprioritizing one's efforts rather than making a sudden departure. The hosts offer tips on how to prepare for quitting, including scripting a resignation letter and setting up a meeting with a direct manager. They also highlight the significance of leaving a positive impression by training and handing over work, even during the notice period. The hosts delve into the complexities of exit interviews and debate the merits of being honest during these discussions. They stress the importance of maintaining relationships with former coworkers and offer suggestions on how to do so, such as giving recommendations and arranging catch-up meetings. Finally, the hosts touch on alternatives to quitting and suggest focusing on the aspects of a job that bring satisfaction while seeking a gradual transition. They suggest doubling down on enjoyable tasks and nurturing relationships with colleagues when it's not possible to quit right away. Ultimately, the episode provides valuable insights for listeners navigating the decision to leave a job and offers practical advice for managing the quitting process and its aftermath."}