{"podcast_details": {"podcast_title": "Badass Digital Nomads", "episode_title": "Living in Panama Like a Local: Real Estate, Cost of Living, Visas, Culture, and More", "episode_image": "https://ssl-static.libsyn.com/p/assets/e/e/8/6/ee8628dbb9dd2d03a04421dee9605cbd/Badass_Digital_Nomads_-_Podcast_Cover_Art.png", "episode_transcript": " You come here and you see it, right? And you're looking around going like, wow, this is really a welcoming place. All of the great restaurants we have, that kind of gives you an idea that there are these international communities that have formed here and are thriving here. So we have a huge Korean community. There's a huge Lebanese community. There's a huge Greek community, just people from all over the world that have been welcomed here. And this is not just now. This is something that has been happening for decades. Welcome to Badass Digital Nomads, where we're pushing the boundaries of remote work and travel, all while staying grounded with a little bit of old school philosophy, self-development and business advice from our guests. Hey there, Kristin Wilson from Traveling with Kristin here and welcome to episode 221 of Badass Digital Nomads. My guest today is Jessica Ramesh, who is the editor for Panama at International Living. And Jessica has been traveling for quite some time. She has called the US, India and Panama home. She also worked for Carnival Cruise Lines and traveled a lot throughout Mexico. And as she sat down for this interview with me today, she had just gotten back from three weeks in Argentina. So today we are talking about her experience there and what the culture and climate and people were like in Argentina compared to Panama. And then we're also doing a deep dive on what it's like living in Panama, how she was able to live there, how she found her jobs, what she did for work to support herself. And also we get into some data on the cost of living, on how to find real estate there, on how she found a great deal on her Oceanview apartment in Coronado and also we're talking a bit about the retiree visa. So settle in for a great conversation with Jessica today. And also you can meet both of us in person at International Living's upcoming Ultimate Go Overseas Boot Camp that's happening September 2nd through 4th in Denver, Colorado. So I will link to our discount friends and family link in the show notes. Sit back, enjoy this conversation with Jessica Ramesh in Panama. Welcome Jessica to Badass Digital Nomads. Where are you joining us from today? I am back in Panama after three weeks in Argentina. So just at home enjoying a beautiful day. Hi, Kristen. And what brought you to Argentina? I actually went to Argentina on an editorial trip for International Living. I have always wanted to visit. I had a sense before I even got there that I was going to fall in love with Argentina and I have a penchant for falling in love with every new country that I visit. But I went and it was as romantic and beautiful as I imagined it to be. So a great, great experience. Oh, where did you go? Just to Buenos Aires? Three weeks is a long time. So did you travel around? It is, it is. And you know for International Living, our focus is so much more on residents than travel and tourism. So I really wanted to give myself time to get over that initial feeling like a tourist and finding your feet and then have time to just sort of settle in and start to feel what the rhythm of life is like there when you're just living there. So I spent a few days in Buenos Aires, of course the capital, but my main destination and where I spent the bulk of my time was Bariloche, which is the Switzerland of the South. It's a ski destination. It's winter there right now and I've been missing winter. So I thought I would go and check it out. Oh, where are you from originally? I grew up in Oregon. So I grew up somewhere that had four seasons. We don't have that in Panama. We do have mountain towns that are cooler. So you can get some variation. I can drive 45 minutes from where I am here at sea level in the beach town of Coronado and be in the midst of the mountains in Sora on a hiking trail. So you can get a little... But no snow. No snow, no skiing, none of that. So if I want real winter, I have to travel. Did you go skiing in Argentina? I went, I did a snowboarding lesson. I'd always wanted to try it. And I figured, I figured I've been skateboarding as a kid and I've been on wakeboards on the water. So I figured snowboarding might be a little bit easier for me than downhill skiing. Super fun, just an intro. And then I did sort of a cross country, what they call ski Nordico or Nordic ski. Oh, okay. I've never tried that, but how did you find the culture there compared to living in Panama? I know it's quite different, but do you speak Spanish fluently living there? I do. And as you know, probably the Spanish in Argentina is quite different, not just because of different slang, which is the case no matter where you go in the world. There's always going to be sort of a somewhat different lexicon, but in Argentina, they conjugate verbs differently as well. I was already familiar with that beforehand. So it wasn't too much of an adjustment for me. And there are a lot of people who speak English, particularly in places like Pariloche, which is a big tourism destination. A lot of the people that I met there, the Argentinians that I met there speak Portuguese, English and Spanish. And nobody made me feel uncomfortable. There wasn't a single time when I was mispronouncing the names of places that I had been to and, you know, just not saying them the correct way until I finally got accustomed to it and it started just coming out the right way, but nobody ever made me feel like I don't understand you or you're not saying it right. And so there was definitely a lot of kindness and just they're accustomed to people coming from all parts of Latin America, I think. Yeah, what is it? Does it really feel like Switzerland there? You know, like a mountain town. It's hard for me to get a visual of it. I mean, I've been to Buenos Aires, which is such a metropolitan hub, very busy. So many people living there. But yeah, did you feel like you're in South America? Did you feel like you were in Europe? What was it like? It's so funny because it really does look like Switzerland. It looks like photos you've seen of Austria, Sound of Music, Switzerland, all of that stuff. But Argentina is such its own thing, you know, traveling from Panama to Costa Rica to Mexico. I have found Nicaragua, Ecuador. I found all those countries to be more comparable. Argentina felt really, really different to me. It just feels like its own thing. And people say that about Panama a lot of the time as well because we are so sort of modern and in many ways, culturally out there on our own. But this was a new experience for me and it really was hard to put it in any one category. But visually, it is absolutely and you know, I was halfway to Antarctica there and I really felt that in the piercing blues of the lake water and the mountains with the snow tops. It's really something that impacts you in a big way. Sounds beautiful. It's definitely on my list. I want to go down there and spend more time in that region and hike Patagonia and it's a I'm featuring it in another video coming up soon. So everyone stay tuned for that and we'll definitely look forward to reading your article about it in International Living. Do you know which month it will come out? I think it's going to be next year. Oh, okay. Looking at the schedule. It looks like we've got, you know, we're always several months ahead in production. So we'll start queuing that up and we might have some other types of coverage before then possibly in postcards and on social media. Right looking forward to it. Well going back to Panama then. So how did you get from Oregon to traveling to Mexico to wanting to live in Panama because reading more about you it sounds like you had lived abroad or traveled abroad quite a bit before you decided to choose Panama as your home. I did. I did. I lived here when I was younger, but the work opportunities weren't you know, there were work opportunities here, but it wasn't it was still a little difficult to find for me at least work that paid enough and so I wanted to live in Panama, but I ended up leaving for for better opportunities and I went to work on cruise ships and after seeing some of the quote-unquote most beautiful places in the world decided, you know, if it's not Hannah Mott's probably going to be Mexico. I just feel like Mexico will always be a part of my life and I love the culture and just the vast world of Mexican cuisine and cultures is fascinating to me and probably always will be but after evaluating all of the great places I went to it really was Panama that called to me and my mom had spent time in Panama when she was young my grandfather had come to Panama from India. So my family has this long connection with Panama and people here Panamanians say that once you've been here Panama just always calls you back and you can never come here just one time certainly in the case of my family that has been proven to be true because we're originally from India, but this country has just has such a hold on me. So how did you end up living there when you were younger was that with your family? I lived here for a few years with my mom and dad when I was in high school. That was when I learned Spanish after the first year, you know when you're still at that age you can you become fluent just sort of taking it in by osmosis. So the first year was rough trying to be in school and make friends and not really speaking the language. But after that first year I became I always say I'm 99% fluent. I still get some stuff wrong. It's not the language. It's not my first language, but I can definitely pass for a native speaker and then I went back to the States for college and stayed there for a little while after college as well. And then one day woke up and was sort of like what am I doing? I really want to see if I can make a life for myself in Panama. And so I literally gave my notice at my job and within two weeks was back in Panama trying to figure out what I was going to do to make money. And so anytime you land in an expat destination a lot of them if you don't know what you're going to do for an income you can find an English teaching job and you can make a little bit of money while you figure stuff out. And so that's what I did. I started teaching English. I eventually landed my dream job I thought at the Panama Canal and I worked there for one year as a writer slash editor in their corporate communications department and on paper. It was a dream job the Panama Canal and I was doing all these interesting assignments. One of my assignments we were going in with the maintenance crew the culverts that are massive culverts of the Panama Canal that bring in the fresh water for the lock system. We were walking through them with hard hats on and I had a film crew following me like such a cool and interesting job. I got to interview so many interesting people and see the inner workings of this iconic and feat of engineering place in Panama, but parts of the experience were not positive as well. There was a toxic environment in my office I thought and so I left again. That was because I got the opportunity to work on cruise ships and I thought well, you know, I'm not independently wealthy. If I want to see the world this seems like a good way to do it. And so I did that for four years and then once again was like I have to give Panama another try and so took a leave of absence and came down and that was the time that stuck. So what was the job just out of curiosity the job that you quit in Oregon when you moved to Panama because I think a lot of people feel like they're stuck in their situation and they want to live abroad but it's like something that can happen maybe many years from now and it's interesting to hear your story because you had a job in Oregon and then you quit and went to Panama to figure it out once you got there without having that plan and without necessarily having any experience to be able to work for the Panama Canal. So how did you make that transition with your skill set? So I actually grew up in Oregon. So I was there during my formative years as a kid the job that I was scared to leave and where I had that same experience, you know, I want to live in Panama, but I'm afraid to leave my job was my cruise ship job. I had been there for four years in the hospitality industry. Oh in the US. I was based out of Miami. I mean we went all over but it was a it was Carnival Corporation, which is a US based company. And so my home or homes were Miami twice a week, Mexico on Wednesdays, Cozumel on Wednesdays, Q West on Tuesdays and the Bahamas on Saturdays. So for four years my home was ship Miami, Bahamas, Q West, Cozumel. That's pretty fun though. Well, I've heard pros and cons of working on cruise ships. So who would you recommend that kind of lifestyle for and what was your job on the ship? So who I would recommend that kind of lifestyle for is if you're in your 20s, it's really not certain by the time I hit the age of 29. I was like this industry is going to kill me. I will burn out. It's one of the classic burnout jobs. You hear about those jobs that you can only do for a few years before you either sort of start to go crazy or if you're in tune with your body and your mental and emotional needs you realize that you need to make a change and you can't keep this up forever. So it's a fantastic job while you still feel like you're young enough to not get a lot of sleep and it's a very big party atmosphere among the crew members as well. Probably not as fun if you're not into that. But my job was considered one of the worst jobs you can have on a cruise ship. I was a purser which on Carnival Cruise Lines meant that we did customer service. So if anybody was unhappy out of the thousands of happy people on the ship, you tended to see the unhappy ones are the ones that needed something resolved not the happy ones coming up to you to say we're having such a great time on board. The waiters and waitresses got to see them more than we did. We did some cash handling and we also did the paperwork for customs and immigration. So it was really like cramming three jobs into one. You don't get to sleep a lot role. Yeah, did you get to see anything? Do you get any time off where you can kind of explore a little bit in Mexico and the keys and the places that you are going? You do. You never got full days off. That part of the contract is that you work six to eight months and I generally needed to work more than that to be able to make enough to take time off which was always unpaid. But you know your work schedules were always different. So you might have shifts where you're working the whole time you're in Cosmo and you don't get to get off the ship. But generally speaking I did get plenty of time to be able to run out and have dinner. Sometimes you might work a two-hour shift and then have the rest of the day free. So over time I did get to do some really cool stuff. I mean I swam with stingrays and you know did all the different snorkeling trips and I got to bring out a new ship from Finland, which was an amazing opportunity. Most of the ships that Carnival was building new ships at the time they came out of shipyards in Italy or Finland and if you got chosen for that first maiden voyage, then you would go a couple weeks early and you got to be in Finland and set up the ship and get free massages from the spa staff that were testing everything out. And then I got to do some amazing ports of call when we did transatlantic crossing. So it was a fantastic experience, but really hard work. It was 70 hours minimum a week required by contract. Wow, I almost did that coming out of college. So it seems like that would have been the time to do it. And my other option because you know, as many people know, I've been living abroad a long time, but there's different methods and like different paths to being able to live abroad and you might find these different paths at different areas of your life. So coming out of college, I was looking at working on a cruise ship. I was looking at teaching English in Japan and ultimately I started working in real estate. But so I'm curious how you went from the cruise ship to then teaching English in Panama and how did you find that job? And then how did you transition into being a freelance writer? Yeah, so at the time this was early 2000. So a lot of people still didn't have internet in their homes. This was a time before we knew the word influencer as it's used today and there just weren't as many people there weren't as many sort of average Joe people making a living online as there are today today. It just seems like the possibilities are infinite. So at the time I went back to Panama on a leave of absence from my cruise ship job and through the expat community found a bunch of teaching jobs. And so, you know, I was taking taxis and going from here to here and teaching in different parts of Panama. I continued to interview for just any kind of job during that time and I ended up getting hired by a company that was setting up a call center in Panama. They were kind of they kind of ended up being shysters, but I didn't know that it was a very well-paying job and they just wanted somebody who was bilingual who could assist them who you know, wasn't afraid to go to government offices or interview Panamanians to hire them for the call center that sort of thing. And so I fit the bill. I did that job for a while almost a year and continued to interview the whole time because I was like this is not going to last and I need to find something. I need to find something I love and I need to find something that I feel like is lasting and then on Monster.com. Remember this is years and years and years ago. I found an ad for International Living. They were looking for an assistant editor to relocate from the US to Panama and I had been really wanting to get back into writing getting paid to write. I had loved that part of my job at the Panama Canal and I thought I'll take any in I'll be the secretary. I'll be the assistant editor like just any way that I can get into magazine company a publishing company. I'll take it. So I interviewed for the assistant editor job and then met a wonderful lady named Susan Haskins who I believe you've met already and we loved each other and that started a 17 year 17 plus year love affair with International Living and I've just climbed up through the ranks since then. Oh my gosh amazing. I didn't realize you'd been working with them for 17 years. Yeah, yeah going on 18 now you basically saw job description for being yourself. You're like this is me. I've already done this from the US moved to Panama. What visa were you on there because you had lived there on and off. So did you have citizenship or residency? How is that working? I do. I'm very very fortunate. I always say one of the best things that could have happened to me is that I do have Panamanian citizenship. I was actually born here. My parents left and I was very small because of the dictatorship in Panama. So I grew up in Oregon and my parents were from India. So we didn't speak Spanish at home. I didn't have Panamanian aunties uncles cousins. My whole family was Indian but Panama confers citizenship and once you get that it is written into the law that you cannot lose this citizenship no matter what if you're born there. Yeah, and even if you become you know, there are paths to citizenship, you know for anybody that wants to become a Panamanian citizen most of the expats here just live here as residents, which is fine. You don't typically you don't need much more than that. But for those who really feel like, you know, I want to belong in a different way. I want to pass those tests in Spanish. I want to get that passport so that it's my backup passport. You can do that here and once you have residents once you have citizenship this country is committed to has a track record of maintaining that and saying once you belong you belong. So what would you say is the most popular method for people to get that visa or permanent residency or citizenship because I know Panama has changed things up in recent years on their citizen citizenship by investment program. So give us the lowdown for 2023. So one of the really interesting things is that historically if you came to Panama on the most popular visa, which is the pension auto or the pensioners visa, which is not the only option, you know now Panama welcomes people of all ages. It always has welcomed people of all ages. But if you come here through that pensioners visa the verbiage says that you're not eligible for citizenship. However, in practice for quite some years now the government has been allowing people who are here on that visa to obtain their national ID card to make use of all of the pensioner discounts that Panamanians get to use and to qualify for citizenship if you want to great. And what are the income requirements for that right now? So if you're coming here on the pensioner visa you need to demonstrate that you have a corporate or Social Security pension of at least $1,000 a month if you're including a spouse or a dependent then it then you have to add an additional 250 or there's a workaround through which you can either buy property then it goes down to 750, but you don't have to buy property here. It's just an option and there's another workaround where if your pension is just you just have the $1,000 a month pension and your spouse does not have an additional 250 that you can pull together to make that 1250 threshold then you can deposit some money into a bank account. I believe it's not a huge amount 2 to $5,000 right now and you can qualify that way and then you eventually, you know can remove those funds. So it's not a payment. It's just a commitment to keep those funds in the bank while you're processing that yeah, still one of the more accessible programs out there. Wise is the cheap fast way to send and receive money abroad with wise you can manage your funds internationally sending spending and receiving money and more than 40 currencies and 150 countries you can get your first transfer free up to 500 euro when you open an account with our referral link in the show notes and you can also apply for a low fee debit card that you can get up to 200 pounds per month and free withdrawals from ATMs worldwide and after that is a very low fee. But what I love about wise is that you can manage your money in different currencies exchanging at very low rates within the app. It's easy to use. I've been using it for more than 10 years and I recommend it to all of my travel and relocation clients use our link in the show notes to get your first transfer up to 500 euro free or go to traveling with Kristin.com slash wise that's traveling with Kristin.com slash wi se and you lived in Panama City for quite some time. Although you're in Coronado now, so give us some insight into the lifestyle in Panama City. What do you love about it? You mentioned that you really love Panama of course being a citizen and having lived there so long, but what are some of the things that you loved about Panama City and what are some areas for improvement? So I've lived in in quite a few different parts of the country Panama City for the longest. Panama City is just a really exciting city and every time I travel I come back and I'm like, wow, we have it good here. And you know, if you stay somewhere for too long, you'll find that expats that have been in a place for too long and they haven't been traveling out of out of that place, whether it's back home or to other countries. They'll start to sort of complain and be like, well, things are getting more expensive and harder and this that the other but if you're the kind of person who's leaving and coming back you come back at least this is my experience with Panama City and every time I come back. I'm like God the city is amazing. We have such a great city here. It's a culinary destination. One of the best in the world. It's recognized by UNESCO as a culinary world capital. It is this metropolis that while I was living there, I was living there for 17 years was just growing into its own and it was already a pretty exciting place. When I moved there, there were lots of theaters. There was lots going on culturally in the sporting and athletics world, whatever your interests you could generally find a group that was into that that you could join, but I watched them, you know, create their first Jazz Festival and one of the region's premier International Film Festivals and just continue to level up on all of these things that really make a city worth living in not just because it's convenient and has fantastic internet and cell phone connections, but also because it really is that true definition of a cosmopolitan capital and then Panama City is a cosmopolitan world capital on the ocean, which is very rare outside of the hurricane zone, which is even more rare with mild weather. It's really hard to find another place on the planet that comes close to offering these things in this hemisphere in such close proximity to the US. It's just kind of unbeatable. So it has you asked about the challenges and there are many challenges. It's a louder city than most of the US cities that I visited that are comparable. It is it's a Latin City. So there are very different perspectives on what is acceptable as far as noise levels barking dogs, loud music, that type of thing traffic and the way people drive the way people drive can be a shock if you've never traveled and driven in other countries, of course for me having lived in India and having, you know, seen the way people drive in Italy and other parts of Europe. I have a different perspective on the traffic in Panama. I don't think it's that bad, but it is one of the deal-breakers sometimes for people. I do have to say that I had one of the best meals of my life in Panama and it was in Casco Viejo or is it Casco Viejo or Casco Antiguo or both? Both. It's both. Casco Viejo is probably the more common usage but Casco Antiguo has a little bit of an old-school little romanticism to it. Yeah, that is a UNESCO World Heritage Site, correct? Yes. Yeah. So this is if you haven't been to Panama City, it's like the old town, the historic center of Panama City. It's so pretty. It's a very kind of colonial architecture. It kind of reminds me of Cuba a little bit like colorful buildings and like surrounded by water, but I wish I could remember the restaurant I went to, but it was my first time ever having a tasting menu and I went with my ex-boyfriend and he's like, oh yeah, we'll do this tasting menu. I was like, what's a tasting menu? And yeah, it was my first time having multiple courses, you know, just small bites of food and like one of the best meals I've ever had and I want to say it was $50 maybe. So ever since then I've had them in Europe and other places and it's always, you know, a bit more but nothing has really stacked up to that first experience. I don't know what it was. I remember having this like truffled egg yolk or something in this big bowl and I was like this is magical. So and also the hotels are really nice. You got really pretty views there. I was staying. This was a long time ago. This was like 20. It was around when I first started my relocation company. Panama was one of our first three destinations. So we worked in Costa Rica, Canada and Panama and then we expanded from there. So I was spending a lot of time there, but at the time there were a lot of buildings that were just kind of speculative for investment. Are there still a lot of empty buildings there or you're shaking your head? No, no, no. So you said this was this was quite some years ago. I would say about 12 years ago. Yeah, it's it's it's undergone a massive transformation. A lot of those buildings have been renovated a lot of new hotels in Casco Viejo now depending on the year. When you were there, there were two restaurants that were known for doing those little tasting menus. One was Manolo Caracol, which is no longer here. And then in recent years, Don De Jose, which is I think it was Caracol. Yeah. Yeah. And we have some of the best restaurants in Latin America. You know, there's a ranking compiled every year of like 50 best in Latin America. We're typically on there. One of our chefs today, probably the most successful in Latin America on that Latin America ranking in Panama has a restaurant called My Eato and it's you know, you want to reserve ahead of time. It's in an unassuming cottage. You wouldn't think but it's one of the best restaurants you can go to in the entire region. It's pretty cool. So that's MAITO. My Eato. And how much would a dinner be there? You know, prices haven't gone up a whole lot since you were here. So depending, you know, without your liquor consumption or maybe with one or two glasses of wine or cocktails, you could probably still be in that 50 to $60 range. When I go, I tend to do the bottle of wine and you know, maybe the digestive or the dessert or the cocktail before and so I probably end up spending 70 or maybe a little bit more. But that's the other great thing about Panama City is you have the choice. Other places are billed as less expensive because there aren't as many temptations. Whereas Panama City, you have those less expensive places, but you also have the world-class culinary destinations and it's completely up to you. You don't have to spend that at all. I don't spend that when I'm going out here in the beach region where I live. Yeah, that's like a once in a while. You don't want to eat that like that every day or you would probably not feel too good. Exactly. It's pure butter. It's a treat. And so for people looking for a real estate there, well first, can you give us an idea of what are the rent prices around Panama City and Coronado? Let's say for a one or two bedroom furnished apartment. Yeah, so in Panama City or Coronado, you're probably going to spend $900 or more per month to rent something like that. In Coronado, I found that it was just much better value to go ahead and buy the apartment that I'm in right now is just over a thousand square feet. I could rent it out for 900 or more dollars a month very easily. This is a coveted building with resort like amenities, but to buy it was only $155,000. So, you know, my mortgage on that I was able to obtain a local mortgage. My mortgage payment on that is $750 a month. My maintenance fees are $262, I believe, a month. So I'm able to own this apartment as a good investment that I can live in or rent out or sell and make a profit in five years. I'm thinking I'll check and see whether I want to do that when I hit the five-year mark, but it was definitely a better a better deal for me. Now, if you're looking outside of the fancy apartments at homes, maybe a little bit further from the beach, a little bit further from the water, you can spend six to $750 a month on your rent, which is what I did in Panama City. I had a four-bedroom apartment. It wasn't in the fancy areas of Panama City, but it was on a nice Panamanian residential street. I mean $750 a month for four bedrooms and a great kitchen, a very well laid out apartment. I think I had three and a half bathrooms. Yeah. Wow. Was that furnished? It was not furnished. Okay. So you're looking at, you know, 500 to 900 and then for unfurnished or a small furnished apartment and then maybe 900 and up for fully furnished apartment or house in a nice area. And furnished, unfurnished, sometimes you don't see, sometimes it doesn't really make sense what those prices are. The price difference. It really is more about the area and sometimes even more about the building itself that you're choosing. If it's a building with a lot of amenities, you're going to get less space for your money than you would in a building where I was renting for $750 a month, my four bedroom apartment. My building didn't have any amenities, but it was a great apartment and I was a seven minute walk from the metro station. So yeah. And how did you find your apartment in Coronado? You know, being a local and an expat, what was your approach to finding a property there to buy? Because of my work that I do for international living, I wake up every morning and I read the local news and I look at, I'm constantly looking at real estate. So I have a favorite website, compreoalquile.com and I was checking it just routinely. I've been on the verge of buying an apartment in Panama City and as sometimes happens in Latin America, I got the loan, was about to close on the apartment and then the owner decided to raise the price by $30,000. So that fell through and after that fell through for the next year, I would just on and off look and sometimes what I would do was say, you know, I'm going to remove Panama City as a parameter and I'm just going to put in at least a thousand square feet, at least 1.5 bathrooms anywhere in the country. Let me just see what comes up and this apartment in Coronado came up and there wasn't much info on the listing, but it looked like a well laid out apartment and I'm very fussy about that sort of thing and I was cutting up to visit some friends. So I thought well, sure. I'll just go see this apartment on a whim. I'm not thinking about moving to Coronado. I don't think I'm ready to leave my city yet. And I think the listing said nothing about the views and I walk into this apartment. It was full of trash for some reason there was like old decaying furniture and a pile in the middle and there were some pop tiles, but the view. Oh my God, the view I could see them the mountain of Campana National Park and you know, I'll send you clips or videos. You can splice them in or show them to people and I'm like, why is this listing this building is resort like it has a massive pool downstairs. It has a gym and a sauna and another small pool upstairs and multiple little Jacuzzi jet cold pools because it's too hot for hot tubs and I'm like first I walked into an apartment on the lower floor and I thought well, this is nice and then that was the seventh floor and then she took me to one on the 10th floor and then the realtor says to me she says I have an apartment on the 20th one. I'm like, hold on how much more is that going to cost me because typically apartments go up in price the higher you go and I was like, I've never felt the need in the city to have an apartment on a top floor. It doesn't really make any difference to me. But here it makes a difference in how much you can see of the ocean and the beach. So the view was fantastic and the price was the same. They were selling all these apartments for exactly the same price per square meter. Wow, and then they threw in appliances and new floors and I just got the best deal ever but it was because I just I kept looking and I didn't want to sell for something that didn't feel perfect for me. So I looked for a long time. Wow. So you didn't even have to really yeah, you looked for a long time, but you didn't have to look that much in Coronado because by the time that came up, you knew the comps you knew what was out there and you were ready. It was the first apartment I saw in Coronado, you know, not on an editorial trip or anything just for me and I walked in and I was like, I guess I'm moving to Coronado. Huh? Who knew? I didn't. Yeah, well and happily ever after so for people who haven't been to Panama or to Coronado, this is a beach town about 30 minutes from Panama. How far it's an hour's drive. Now. We've had some growing pains with the Pan American Highway and it all depends on traffic on that highway during holidays or even weekends. It can be three hours, but they they're doing a lot of work right now very exciting work on the Pan American Highway and it's it's getting so so much better. And so I've already seen my times my travel time start to drop back down towards towards that. I'm going to say on average two hours right now. Oh, wow. But mileage wise when when you're outside of those rush hours, it really is an hour long trip and when I was prior to my move when I was coming up and down, you know, checking paint samples and measuring things. I did it a bunch of times in one hour. Okay. And what is the ambiance like there? I know it's a surf town. I know it's also got some good golfing. I've had some clients move there, but I haven't actually been there myself. So how is it different from the other beach towns in Panama and what attracted you to living there? Coronado is very very different. It's not a tourism destination. We actually don't have a good surfing beach right in Coronado. We do have just before Coronado Chame, which is a very windy beach. So it's great for kite surfing. It's sort of the kite surfing capital of Panama and then there are beaches all along this coastline within a 30 to 60 minute drive from where I am in Coronado that are better surfing beaches, but Coronado actually started out as a family compound. It was one family the Eisenman family that owned that had bought a vast tract big enough for a town of property and they started, you know, parceling off plots and selling them and developing little communities and making money that way. And so it's a gated community very casual. There's a main gate that is easy to pass through if you say you're coming to visit somebody or to go to one of the restaurants in town. You get through that and then within that there are smaller communities. So I'm actually in a gated community within that gated community of Coronado and then my building has its own security gate. So you couldn't ask for more for more a more secure location, but because it's so residential and not a tourist destination, it's sort of not the place that gets talked about in lonely your lonely planets and whatnot, but it is one of the most fantastic destinations as far as access to if I need anything from Panama City, which lately I don't because we have developed into a little hub here. But if you want to go into Panama City to see the opera for a show, it's so easy to do that from Coronado. As I mentioned before, I'm also about a 45-minute drive from not just the one that I mentioned, but two of my favorite mountain towns. So anytime I want to be in the mountains feeling like I'm in, you know, somewhere like Switzerland enjoying that cool weather do a little hiking spend the weekend, maybe even I'm so close by so I feel like I'm in this very privileged location in Panama. What's the other mountain town that you like? El Valle and Sorá. Okay, I have not been there. I imagine you've traveled a lot throughout Panama. Are there any other kind of hidden gems that you can share with us? I know a lot of people know Boca del Toro, which is somewhere that I've been a few times as well, but I'm sure there's lots of other places off the beaten track. But Boca del Toro is one of my favorite places on planet Earth and I think you know having spent so much time in the Bahamas, it's astounding to me that we have this here. It's every bit as beautiful. It's Caribbean and a lot of people don't know about Boca del Toro. We have another province in Panama where you'll find the district of Portobello and that is not as many people here about Portobello as Boca del Toro. It's way less developed, way less much much smaller tourism footprint, but an incredible destination that I've gotten to know because I have an expat friend who has a home there and so I go and spend time with her there and I've gotten to know the area and I've gotten to write about it as well. So that's definitely one of the hidden hidden gems of the Caribbean. And then I was just in the province of Cherokee, which has a lot to offer. It has our best mountain towns, some of the destinations that have been highlighted in publications like AARP as well as International Living as one of the best retirement destinations in the world in the mountain region of Cherokee, but that province also has a coastline and you have these beaches and islands that are pristine and there's nothing on like no plastic lounger, chases taking up the beach, no restaurants, no hawkers trying to sell you beaded jewelry, just nothing. Just like natural virgin empty beaches. Yeah, they look like they probably looked a thousand or 10,000 years ago. It's unbelievable. And you can just drive there? You can just drive there. Okay, so these are the beaches near Cherokee. This is the Cherokee provinces coastline. So and I actually did you can fly from Panama City if you want to shave some time off your travel, but I actually being in Coronado, I was already one hour west of Panama City. So I just drove the additional four hours to the capital of Cherokee and then spoke out from there to mountain towns and then down to the coast. And I've heard that the roads are pretty good out there. I've only really been to the islands into the city, but it's pretty good highways through most of Panama, right? Yeah, it is. Yeah, I always just rent the smallest cheapest sedan type car and I'm able to do all of my travel. Yeah, see in Costa Rica, you need to go with the four-by-four in Panama. You can just rent whatever and a lot of the cars. I did do Grecia and San Ramon and you know that little area. I did that with a little cheap rental car to and Costa Rica. That would be tough going up those hills. No, a lot of the cars in Costa Rica get imported from Panama because it's cheaper there but and the cost of living is lower there as well. I would say it's about half the price of living in Costa Rica. I mean, maybe it's gone up a bit but you could live in Panama and 1500 to 2000 a month. You can't not I wouldn't recommend anybody on that budget come to here to Coronado. It's a little bit. It's one of the premier retirement destinations in the world. So it's a little bit higher. I'm living here on closer to right now probably closer to $2,900 a month and I keep a really strict budget where I put everything. Okay, so maybe that is about the same. I would say Costa Rica is like for expat life like minimum 2500 to 3000 unless you're getting like a $500 studio in San Pedro and shopping at the markets and you can keep it lower but yeah, and here's well like Cherokee the Cherokee province is it's less expensive than where I'm living in Coronado now. So you can definitely do that on $2,000 a month particularly if it's a single person or a couple and you don't feel like you want a huge house and you're happy to have just more of a simple Panamanian style home. There are great options. You don't need air conditioning. You don't need heating. So your electricity bill is negligible. It's and you've got all this fantastic fresh fruit and vegetables that are grown right there pork and beef from right and chicken from right there seafood. That's coming that source domestically as well. So it's a very inexpensive place to eat well and live well again, if you don't need a mansion like home. Yeah, I love that like local tropical fruits and everything. So being a Panamanian citizen also having the perspective of being an expat and then knowing other foreigners and locals that are living there. What would you recommend to people who are looking to move there as far as integrating with the local culture, you know, getting to know people like locals as well as foreigners learn Spanish or how welcoming are the locals to especially people from the US, you know, given the history of the Panama Canal and some of the contention that has been there in the past. I'd say that Panama is still one of the most welcoming countries to Americans. You don't hear or see a lot of anti-US sentiment here even given everything, you know that happened. So it's certainly in the, you know, 70s and when the Canal Treaty was being renegotiated, there was probably a lot more of that. But you know, how many years ago are we talking for that now? I also find people here to be just very welcoming to newcomers and foreigners in general. My family came here from India. They felt welcomed. One of my closest Panamanian friends is also Asian like me. She's Chinese. Her family came here from China and felt welcomed. So we've had very similar experiences as immigrant kids in a country that just was like you come here and you see it, right? Like you see the synagogues and the mosques and the Hindu temples and you're looking around going like wow, this is really a welcoming place. All of the great restaurants we have that kind of gives you an idea that there are these international communities that have formed here and are thriving here. So we have a huge Korean community. There's a huge Lebanese community. There's a huge Greek community, just people from all over the world that have been welcomed here and this is not just now. This is something that has been happening for decades. So you're going to find like that's very very apparent in Panama City, but I know gay American expats who have moved to a little town on the Azuero Peninsula of Panama and felt immediately welcomed when they moved there. So it's really something that you find throughout the country moving here to Coronado. There was no break in my social activity. There were no lonely weekends. Now I chose my building. Well, this is a building where on Tuesdays we have a social hour if you want to and if you have time 5 p.m. on Tuesdays, whoever's free is gathering up there. You bring a cocktail. If you want to bring snacks to share you can do that as well, but you don't have to so I had that, you know, I was able to get to know some of my neighbors immediately. Thanks to that. We have a potluck once a month, which is my favorite thing. So I try to always always always make it to potluck. I enjoy cooking for other people and I enjoy having a smorgasbord of different things to try. So I instantly met new people and made friends not all of the expats in my building are from the States. I met there a couple families here that are Indian and so I met some of my paisanos from India and there we have obviously local owners in the building almost anywhere you go in Panama more than 50% of your neighbors are going to be Panamanian Columbia in Venezuela and they're going to be Latin. So there's no sense that it's just expat living. That's good in you're going to be talking about Panama at the International Living's boot camp coming up. Correct. What is your topic for your talks or talk or talks? I am I am going to be talking about Panama. We have intros to the different countries that are going to just sort of give you the basic information to hook you and then we will have longer workshops on the prime destinations and so you're going to be able to get a lot of info on those if you're attending. I'm also giving a talk that I've been giving for some years now on just being a single expat overseas and that's a very general talk where we talk about networking how to just start the right way how to you know start before your move making connections and how to hit the ground running when you get there and it's a great talk even if you're not single if you're concerned about networking and meeting people. That's a great one to attend as well. Great. Oh, I look forward to meeting you in person and thank you for sharing your insights and local tips on moving to Panama and in the local lifestyle there. So it's been great having you on the show today. Thank you, Kristin. It's been fantastic being here and yet I can't wait to see you in Denver. See you soon. Bye. I hope you enjoyed my conversation with Jessica today. It was so fascinating for me to get to hear how she ended up living there and I thought it was so inspiring how she made the decision that she wanted to live in Panama whether she was by herself or not and how she took the steps to make it happen and worked her way up from working odd jobs teaching English and at the Panama Canal to ultimately finding her long-term position at International Living. Remember that you can meet Jessica and I and 200 other overseas experts in person this September at International Living's Ultimate Go Overseas Boot Camp and I'll link to our Traveling with Kristin friends and family discount in the show notes below. Thanks for hanging out with me today and we have a lot of brand new interviews coming your way in the upcoming months. So stay tuned for much more and I'll see you again next week."}, "podcast_summary": "In this podcast episode, guest Jessica Ramesh, editor for Panama at International Living, discusses her experience living and traveling in Panama and Argentina. She describes how Panama is a welcoming place with diverse international communities, including a large Korean, Lebanese, and Greek community. Jessica shares her experience living in Panama and how she was able to find work and support herself. She also provides insights on the cost of living, finding real estate, and obtaining the retiree visa. \n\nJessica also talks about her recent trip to Argentina and compares the culture and climate there to Panama. She discusses the different regions she visited, including Buenos Aires and Bariloche, and the beautiful landscapes and natural beauty she experienced. Jessica also highlights the importance of learning Spanish and how the locals in Argentina were welcoming and kind. \n\nFinally, Jessica shares her love for Panama City and Coronado, describing them as vibrant and cosmopolitan destinations with great amenities and culinary scenes. She mentions some hidden gems in Panama, such as the Cherokee Province and Portobello, that offer pristine beaches and untouched natural beauty. Jessica concludes by emphasizing Panama's welcoming nature and the ease of integrating into the local culture.", "podcast_guest": {"guest_name": "Jessica Ramesh", "summary": "YouTube, LLC is an American online video sharing and social media platform headquartered in San Bruno, California, United States. Accessible worldwide, it was launched on February 14, 2005, by Steve Chen, Chad Hurley, and Jawed Karim. It is owned by Google and is the second most visited website, after Google Search. YouTube has more than 2.5 billion monthly users, who collectively watch more than one billion hours of videos each day. As of May 2019, videos were being uploaded at a rate of more than 500 hours of content per minute.In October 2006, YouTube was bought by Google for $1.65 billion. Google's ownership of YouTube expanded the site's business model, expanding from generating revenue from advertisements alone to offering paid content such as movies and exclusive content produced by YouTube. It also offers YouTube Premium, a paid subscription option for watching content without ads. YouTube also approved creators to participate in Google's AdSense program, which seeks to generate more revenue for both parties. In 2021, YouTube's annual advertising revenue increased to $28.8 billion, an increase in revenue of 9 billion from the previous year. YouTube reported revenue of $29.2 billion in 2022.Since its purchase by Google, YouTube has expanded beyond the core website into mobile apps, network television, and the ability to link with other platforms. Video categories on YouTube include music videos, video clips, news, short films, feature films, songs, documentaries, movie trailers, teasers, live streams, vlogs, and more. Most content is generated by individuals, including collaborations between YouTubers and corporate sponsors. Established media corporations such as Disney, Paramount, NBCUniversal, and Warner Bros. Discovery have also created and expanded their corporate YouTube channels to advertise to a greater audience.\nYouTube has had unprecedented social impact, influencing popular culture, internet trends, and creating multimillionaire celebrities. Despite its growth and success, it has been widely criticized for allegedly facilitating the spread of misinformation and the sharing of  copyrighted content, routinely violating its users' privacy, enabling censorship, and endangering child safety and wellbeing, and for its guidelines and how they are implemented."}, "podcast_highlights": "In this podcast episode, Jessica Ramesh, the editor for Panama at International Living, shares her experience living in Panama and her recent trip to Argentina. She discusses the welcoming nature of Panama and the various international communities that have formed and thrived there. Jessica also talks about the cost of living, real estate options, and the retiree visa in Panama. She highlights the beauty of Argentina and the cultural differences compared to Panama. The podcast ends with a discussion about integrating into the local culture and making connections as an expat in Panama."}